app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("price", "location", "created_at", "title", "updated_at", "text", "description") VALUES(32.0, 'bern', '2009-11-12 19:22:26', 'asdfsadf', '2009-11-12 19:22:26', 'sdafasdf